
static class BelarussianData
{
    public static readonly string[] names =
    {
            "Аляксандр", "Аляксей", "Андрэй", "Артур", "Арцём", "Барыс", "Вадзім", "Валерый", "Валянцін", "Васіль",
            "Віктар", "Віталь", "Вячаслаў", "Даніла", "Дзмітрый", "Іван", "Ігар", "Ілья", "Кірыл", "Леанід", "Максім",
            "Мікалай", "Міраслаў", "Міхаіл", "Міхась", "Павел", "Пётр", "Руслан", "Станіслаў", "Стась", "Сцяпан",
            "Усевалад", "Фёдар", "Ян", "Ясь", "Яўген", "Алёна", "Алеся", "Аляксандра", "Анастасія", "Анна", "Валерыя",
            "Валянціна", "Варвара", "Вера", "Вераніка", "Вікторыя", "Віялета", "Вольга", "Ганна", "Гелена", "Дар’я",
            "Ева", "Елізавета", "Іна", "Ірына", "Крысціна", "Ксенія", "Ларыса", "Марына", "Марыя", "Настасся",
            "Наталля", "Олеся", "Святлана", "Яна", "Яўлампія"
        };

    public static readonly string[] lastNames =
    {
            "Смірноў", "Іваноў", "Кузняцоў", "Сакалоў", "Папоў", "Лебедзеў", "Казлоў", "Новікаў", "Марозаў", "Пятроў",
            "Волкаў", "Салаўёў", "Васільеў",
            "Зайцоў", "Паўлаў", "Сямёнаў", "Голубеў", "Вінаградаў", "Багданаў", "Вараб'ёў", "Фёдараў", "Міхайлаў",
            "Бяляеў", "Тарасаў", "Бялоў",
            "Камароў", "Арлоў", "Кісялёў", "Макараў", "Андрэеў", "Кавалёў", "Ільін", "Гусеў", "Цітоў", "Кузьмін",
            "Кудраўцаў", "Баранаў", "Кулікоў",
            "Аляксееў", "Сцяпанаў", "Сяргееў", "Захараў", "Каралёў", "Панамароў", "Грыгор'еў", "Смірнова", "Іванова",
            "Кузняцова", "Сакалова", "Папова", "Лебедзева", "Казлова", "Новікава", "Марозава", "Пятрова", "Волкава",
            "Салаўёва", "Васільева", "Зайцава", "Паўлава", "Сямёнава", "Голубева", "Вінаградава", "Багданава",
            "Вараб'ёва", "Фёдарава",

            "Міхайлава", "Бяляева", "Тарасава", "Бялова", "Камарова", "Арлова", "Кісялёва", "Макарава", "Андрэева",
            "Кавалёва", "Ільіна",
            "Гусева", "Цітова", "Кузьміна", "Кудраўцава", "Баранава", "Кулікова", "Аляксеева", "Сцяпанава", "Сяргеева",
            "Захарава",
            "Каралёва", "Панамарова", "Грыгор'ева"
        };

    public static readonly string[] cityes =
    {
        "Мінск", "Гродна", "Брэст", "Віцебск", "Магілёў", "Бабруйск", "Барысаў", "Гомель", "Мазыр", "Орша", "Полацк",
        "Рэчыца", "Слуцк", "Скідаль", "Шчучын", "Горкі", "Навагрудак", "Іўе", "Смаргонь"
    };

    public static readonly string[] streets =
    {
        "Акадэмічная", "3 Верасня", "50 год Перамогі", "Абрыкосавая", "Абухоўская", "Адзінцова", "Азгура", "Азёрная",
        "Акадэміка Курчатава", "Бабруйская", "Бабушкіна", "Беларуская", "Валадарскага", "Вакзальная", "Ватуціна",
        "Верхняя", "Геалагічная", "Дамброўская", "Ельніцкая", "Замкавая", "Кальцова", "Клумава", "Лізы Чайкінай"
    };

    public static readonly string[] patronymics =
    {
        "Данниевич", "Андрэевіч", "Аляксеевіч", "Аляксандравіч", "Вадзімавіч", "Васільевіч", "Вітальевіч", "Вячаслававіч",
        "Давыдавіч", "Дзмітрыевіч", "Канстанцінавіч", "Карнеевіч", "Багдановіч", "Барысавіч", "Гаўрылавіч", "Генадзевіч",
        "Іванавіч", "Мацвеевіч", "Мікалаевіч", "Алегавіч", "Сямёнавіч", "Яраслававіч", "Піліпавіч", "Андрэеўна", "Аляксееўна", "Аляксандраўна", "Вадзімаўна", "Васільеўна", "Вітальеўна", "Вячаславаўна",
        "Давыдаўна", "Дзмітрыеўна", "Канстанцінаўна", "Корнеевна", "Багданаўна", "Барысаўна", "Гаўрылаўна", "Генадзьеўну",
        "Іванаўна", "Мацвееўна", "Мікалаеўна", "Алегаўна", "Сямёнаўна", "Ярославовна", "Піліпаўна"
    };
}
